tap "anomalyco/tap"
tap "nikitabobko/tap"
tap "oven-sh/bun"
brew "bat"
brew "cocoapods"
brew "colima"
brew "docker"
brew "docker-compose"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "gradle"
brew "lazydocker"
brew "lazygit"
brew "mise"
brew "neovim"
brew "pnpm"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tmux"
brew "tpm"
brew "tree-sitter-cli"
brew "xcode-build-server"
brew "zinit"
brew "zoxide"
brew "anomalyco/tap/opencode"
brew "oven-sh/bun/bun"
cask "nikitabobko/tap/aerospace"
cask "android-studio"
cask "bruno"
cask "cloudflare-warp"
cask "datagrip"
cask "firefox"
cask "flutter"
cask "font-maple-mono-nl-nf"
cask "ghostty"
cask "google-chrome"
cask "keka"
cask "stats"
go "cmd/go"
go "cmd/gofmt"
go "github.com/fatih/gomodifytags"
go "github.com/cweill/gotests/gotests"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "olexsmir.xyz/json2go/cmd/json2go"
